In [6]:

import pandas as pd

df = pd.read_csv('final_food_delivery_dataset.csv')
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [8]:

df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

          order_id       user_id  restaurant_id  total_amount        rating
count  10000.00000  10000.000000   10000.000000  10000.000000  10000.000000
mean    5000.50000   1504.117700     251.016700    801.162412      4.045430
std     2886.89568    861.727776     144.622558    405.458753      0.606531
min        1.00000      1.000000       1.000000    100.200000      3.000000
25%     2500.75000    761.000000     127.000000    446.310000      3.500000
50%     5000.50000   1508.000000     251.000000    806.295000      4.100000
75%     7500.25000   2250.250000     376.000000   1149.227500      4.600000
max    10000.00000   3000.000000     500.000000   1499.830000      5.000000

In [12]:
gold_orders = df[df['membership'] == 'Gold'].shape[0]
hyd_revenue = round(df[df['city'] == 'Hyderabad']['total_amount'].sum())
unique_users = df['user_id'].nunique()

gold_orders, hyd_revenue, unique_users

(4987, 1889367, 2883)

In [14]:
df[df['membership'] == 'Gold'].shape[0]

4987

In [16]:
round(df[df['city'] == 'Hyderabad']['total_amount'].sum())

1889367

In [18]:
df['user_id'].nunique()

2883

In [20]:
round(df[df['membership'] == 'Gold']['total_amount'].mean(), 2)

797.15

In [22]:
df[df['rating'] >= 4.5].shape[0]

3374

In [24]:
gold_df = df[df['membership'] == 'Gold']
top_city = gold_df.groupby('city')['total_amount'].sum().idxmax()
gold_df[gold_df['city'] == top_city].shape[0]

1337

In [26]:
df.groupby(['membership', 'cuisine'])['total_amount'].sum()

membership  cuisine
Gold        Chinese     977713.74
            Indian      979312.31
            Italian    1005779.05
            Mexican    1012559.79
Regular     Chinese     952790.91
            Indian      992100.27
            Italian    1018424.75
            Mexican    1072943.30
Name: total_amount, dtype: float64

In [32]:
df[['restaurant_id', 'cuisine']]

      restaurant_id  cuisine
0               450  Mexican
1               309   Indian
2               107  Mexican
3               224  Chinese
4               293  Italian
...             ...      ...
9995            249  Italian
9996            267  Chinese
9997            420  Italian
9998            492  Italian
9999            439  Mexican

[10000 rows x 2 columns]

In [34]:
df.isna().sum()

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city                 0
membership           0
restaurant_name_y    0
cuisine              0
rating               0
dtype: int64